{

	"resultInfo" : [
	    {
	    	"title": "ISTJ" ,
	    	"type_img" :"./img/istj.png",
	    	"type_title" : "논리주의자 ",
	    	"type_detail" : "신중하고 조용하며 집중력이 강하고 메사에 철저하며 사리분별력이 뛰어나다.",
	    	"detail_info" : "실제 사실에 대하여 정확하고 체계적으로 기억하며 일 처리에 있어 서도 신중하며 책임감이 강하다. 집중력이 강한 현실감각을 지녔으 며 조직적이고 침착하다. 보수적인 경향이 있으며, 문제를 해결하는 데 과거의 경험을 잘 적용하며, 반복되는 일상적인 일에 대한 인내 력이 강하다. 자신과 타인의 감정과 기분을 배려하며, 전체적이고 타협적 방안을 고려하는 노력이 때로 필요하다. 회계, 법률, 생산, 건축, 의료, 사무직, 관리직 등에서 능력을 발휘하며, 위기상황에서도 안정되어 있다. 정확성과 조직력을 발휘하는 분야의 일을 선호한다.",
	    	"character" : ["* 오래된 조직을 좋아한다.","* 선입견이 강하다.","* 지나고 난 다음에 따지는 편이다.","* 우리나라에서는 장남 같다, 장녀 같다 라는 소리를 잘 듣는다.",
	    									"* 웃음이 적다.","* 변화에 적응이 더디다.","* 이유 없이 돌아다니지 않는다.","* 틀에 박힌 규칙적인 일을 좋아한다.",
	    									"* 평소에 많이 참다가 폭발하면 상당히 무섭다.","* 원리 원칙적이다."],
	    	"careful" : ["* 얼굴 표정이 변화가 없어서 사람들 처음 대할 때 힘들어 할 수 있기 때문에 먼저 말을 붙이고 웃는 연습이 필요.",
			    		" * 평소에 꼭 필요한 말만하기 때문에 분위기를 썰렁하게 만들 수 있으므로 유머가 필요.",
			    		" * 공휴일에 집에 있기보다는 가족과 함께 나들이가 필요.",
			    		" * 부적이고 현재의 일상적인 것을 중시하기 때문에 장기적 안목이 모자랄 수 있다.",
			    		" * 대인관계의 섬함을 무시하기 쉬우므로 자신과 타인의 감정에 민감할 필요가 있다 ",
			    		" * 자신의 방법과 생각을 불변의 것으로 고집하기 쉬우므로 변화와 다른 가능성에 개방할 필요가 있다.",
			    		" * 지나치게 책임을 지고 나서며 직책이 요구한 이상으로 일을 심각하게 다루는 경향이 있다.",
			    		" * 정서표현에 노력할 필요가 있으며 자신과 타인에 대하여 인간적 요소를 배려할 필요가 있다."],
	    	"person" : "조지 부시, 조지 해밀턴,신사임당, 이미자, 김연아"
	    }, 
	    {
	    	"title":"ISFJ",
	    	"type_img" :"./img/isfj.png",
	    	"type_title" : "수호자 ",
	    	"type_detail" : "조용하고 차분하며 친근하고 책임감이 있으며 헌신적이다.",
	    	"detail_info" : "책임감이 강하고 온정적이며 헌신적이고 침착하며 인내력이 강하다 다른 사람의 사정을 고려하며 자신과 타인의 감정에 민감하며 . 일 처리에 있어서 현실감각을 갖고 실제적이고 조직적으로 처리한다 경험을 통해서 자신이 틀렸다고 인정할 때까지 어떠한 난관이있어도 꾸준히 밀고 나가는 형이다. 타인의 관심과 관찰력이 필요한 분야 즉 의료 간호 교직 사무직 사회사업에 적합하다 이들이 일을 하고 세상일에 대처할 때 그들의 . 행동은 분별력이 있다 때로 의존적이고 독창성이 요구되며 타인에게 자신을 충분히 명확하게 표현하는 것이 필요할 때가 있다",
	    	"character" : ["* 자기 의견을 끝가지 주장하지 못하고 다수 의견에 따르게 된다.",
				    		"* 끈기 있고 성실하며 안정감이 있다.",
				    		"* 여러 사람 앞에서 말하기 힘들어한다.",
				    		"* 책을 목차서부터 읽기 시작하여 끝까지 읽는다.",
				    		"* 치밀성과 반복을 요하는 일을 끝까지 해나가는 인내력이 있다.",
				    		"* 조직에 안정감을 준다.",
				    		"* 남들은 좋으나 본인이 힘들다.",
				    		"* 많은 것을 가슴에 묻어 둔다.",
				    		"* 모험을 하지 않고 아는 길로만 간다.",
				    		"* 나와 타인의 감정에 민감하다."],

	    	"careful" : ["* 술 담배는 전혀 도움이 되지 않음.",
			    		" * 술 안 먹고 노래방 가서 큰 소리로 노래 부르고 춤추는 것이 필요.",
			    		" * 근시적인 안목으로 미래를 보기 쉽다.",
			    		" * 에어로빅 같은 활발한 운동이 성격개조에 좋다.",
			    		" * 주체성과 단독성을 기르고 명령하고 지시하는 역할에도 익숙해지도록 노력해야 한다 ",
			    		" * 자신의 견해를 남에게 발표할 때 충분한 확신을 갖지 못한 것처럼 보이기 쉽다.",
			    		" * 조용하고 표면에 나서지 않는 경향 때문에 실제보다 낮게 평가되기 쉽다.",
			    		" * 상황이나 남의 요망에 대해 충분한 판단 비판력이 부족하기 쉽다."],
	    	"person" : "찰스 디킨스, 마이클 조던, 송윤아, 배슬기, 장동민, 한승연"
	    }, 
	    {
	    	"title":"INFJ",
	    	"type_img" :"./img/infj.png",
	    	"type_title" : "옹호자",
	    	"type_detail" : "인내심이 많고 통찰력과 직관력이 뛰어나며 양심이 바르고 화합을 추구한다.",
	    	"detail_info" : "창의력과 통찰력이 뛰어나며 강한 직관력으로 말없이 타인에게 영향력을 끼친다 독창성과 내적 독립심이 강하며 확고한 신념과 열정으로 자신의 영감을 구현시켜 나가는 정신적 지도자들이 많다 한 곳에 몰두하는 경향으로 목적달성에 필요한 주변적인 조건들을 경시하기 쉽고 자기 안의 갈등이 많고 복잡하다. 직관력과 사람중심의 가치를 중시하는 분야 즉 성직 심리학 심리치료와 상담 예술과 문학분야에 두각을 나타내며 순수과학 연구 개발분야에서 새로운 시도에 대한 열성이 대단하다 이들은 풍부한 내적인 생활을 소유하고 있으며 내면의 반응을 좀처럼 남과 공유하기 어려워한다.",
	    	"character" : ["* 영감력이 뛰어나고 깊이 있는 통찰력이 있다.",
				    		"* 현실의 유행에 대단히 둔감하고 현실과 거리가 멀다.",
				    		"* 보이지 않는 정신세계를 추구한다.",
				    		"* 의미와 동기부여 왜 사나 등에 관심이 많다.",
				    		"* 초 중 고등학교 시절에 방황할 수 있다.",
				    		"* 생각이 많아 현실적응이 어려울 수 있다.",
				    		"* 비유와 은유를 잘한다.",
				    		"* 사람과의 교제 시작이 어렵다.",
				    		"* 나서기보다는 협조자로 적극적으로 돕는다.",
				    		"* 조용히 책보는 것을 좋아 한다."],

	    	"careful" : ["* 현실감을 키울 필요가 있다.",
			    		" * 웃는 연습이 필요 항상 심각해 보일 수 있다).",
			    		" * 가슴에 묻어 두지 말고 풀어내는 것이 필요.",
			    		" * 조직내의 정치성과 자신의 아이디어를 전달 옹호할 기법을 육성할 필요가 있다. ",
			    		" * 자신과 남의 비전을 현실에 비추어 검토할 필요가 있으며 정기적으로 남에게 진실한 피드백을 주는 방법을 배울 것",
			    		" * 현재 상황에 무엇을 완수할 수 있는가에 대해 여유있고 보다 개방적이 될 필요성이 있으며 외골수로 빠지는 성향을 주의.",
			    		" * 남에게 강요하지 못하며 비판에 정면으로 대결하지 못하고 너무 지나치게 자신에게 의존한다."],
	    	"person" : "테레사 수녀, 마던 루터 킹, 마이어 박사, 리차드 기어, 버락 오바마,이영애, 박수홍"
	    }, 
		  {
		  	"title":"INTJ",
	    	"type_img" :"./img/intj.png",
	    	"type_title" : "전략가",
	    	"type_detail" : "사고가 독창적이며 창의력과 비판분석력이 뛰어나며 내적 신념이 강하다.",
	    	"detail_info" : "윗자리에 있는 사람은 고독한 법, 전략적 사고에 뛰어나며 매우 극소수인 건축가형 사람은 이를 누구보다 뼈저리게 이해합니다. 전체 인구의 2%에 해당하는 이들은 유독 여성에게서는 더욱 찾아보기 힘든 유형으로, 인구의 단 0.8%를 차지합니다. 체스를 두는 듯한 정확하고 계산된 움직임과 풍부한 지식을 소유하고 있는 이들은 그들과 견줄 만한 비슷한 부류의 사람을 찾는 데 종종 어려움을 겪습니다. 건축가형 사람은 상상력이 풍부하면서도 결단력이 있으며, 야망이 있지만 대외적으로 표현하지 않으며, 놀랄 만큼 호기심이 많지만 쓸데없는 데 에너지를 낭비하는 법이 없습니다.",
	    	"character" : ["* 아주 이론적이다.",
				    		"* 현실의 유행에 대단히 둔감하고 현실과 거리가 멀다.",
				    		"* 비효율적으로 시간을 끄는 것을 싫어한다.",
				    		"* 놀기 위해서 노는 기술을 배운다.",
				    		"* 겉은 강하나 속은 아주 여리다.",
				    		"* 주부인 경우 살림하기 힘들어한다.",
				    		"* 대인관계 에서 차갑다는 느낌을 줄 수 있다.",
				    		"* 잡담을 시간적 낭비로 본다",
				    		"* 의미가 있는 일은 열성으로 한다.",
				    		"* 혼자서 공상하는 것을 즐긴다."],

	    	"careful" : ["* 의도적으로 가족 오락이나 게임시간을 갖는 것이 필요.",
			    		" * 타인의 의견 피드백과 제안을 수용할 필요가 있으며 감정의 가치에 주의를 기울일 필요.",
			    		" * 혼자 일하기보다는 의도적으로 팀을 통해서 함께 하는 것이 필요.",
			    		" * 남을 인정하는 방법을 배울 필요가 있으며 비현실적 아이디어를 포기하는 것을 배울 필요가 있다. ",
			    		" * 자신의 아이디어와 스타일이 남에게 미치는 영향에 대해 좀더 주의를 기울일 필요가 있다",
			    		" * 지나치게 확신적이고 조금도 양보가 없으며 남들이 접근하거나 도전하는 것을 두려워한다.",
			    		" * 자신의 이상을 추구함에 있어서 다른 비전을 가진 타인을 비평하는 경향이 있다."],
	    	"person" : " 존 케네디, 제인 오스틴, 아이작 뉴턴, 서태지, 이회창, 조선 세종"
		  }, 
		  {
		  	"title":"ISTP",
	    	"type_img" :"./img/istp.png",
	    	"type_title" : "백과사전형",
	    	"type_detail" : "조용하고 과묵하고 절제된 호기심으로 인생을 관찰하며 상황을 파악하는 민감성과 도구를 다루는 뛰어난 능력이 있다.",
	    	"detail_info" : "차분한 방관자이다. 조용하고 과묵하며, 절제된 호기심을 가지고 인생을 관찰하고 분석한다. 때로는 예기치 않게 유머 감각을 나타내기도 한다. 대체로 인간관계에 관심이 없고,기계가 어떻게 왜 작동하는지 흥미가 많다. 논리적인 원칙에 따라 사실을 조직화하기를 좋아한다. 말이 없으며, 객관적으로 인생을 관찰하는 형이다. 필요 이상으로 자신을 발휘하지 않으며, 일과 관계되지 않는 이상 어떤 상황이나 인간 관계에 직접 뛰어들지 않는다. 가능한 에너지 소비를 하지 않으려 하며, 사람에 따라 사실적 자료를 정리, 조직하길 좋아하며 기계를 만지거나 인과 관계나 객관적 원리에 관심이 많다.연장, 도구, 기계를 다루는데 뛰어나며 사실들을 조직화하는 재능이 많으므로 법률, 경제, 마케팅, 판매, 통계 분야에 능력을 발휘한다. 민첩하게 상황을 파악하는 능력이 있다. 느낌이나 감정, 타인에 대한 마음을 표현하기 어려워한다.",
	    	"character" : ["* 소비성 경향이 많다.",
				    		"* 마음에 없는 얘기를 상대방 기분 때문에 하지 않는다.",
				    		"* 일반적으로 조용한 편이나 필요에 따라 사교적이다.",
				    		"* 손재주가 뛰어 나다.",
				    		"* 틀에 박힌 생활을 싫어한다.",
				    		"* 정밀을 요하는 일을 잘 해낸다다.",
				    		"* 개인주의적 성향이 강하다.",
				    		"* 고집이 있고 주장이 강하다.",
				    		"* 객관적 원리에 관심이 많다.",
				    		"* 관심분야가 아니면 처다 보지도 않는다."],

	    	"careful" : ["* 타인에 대해서 의도적으로 관심을 갖는 것이 필요.",
			    		" * 화가 난 얼굴이 창백하게 보일 수 있으므로 얼굴 관리에 신경 쓰는 것이 필요.",
			    		" * 계획을 세우고 바라던 결과 성취에 필요한 노력을 하며 인내심을 함양할 필요가 있다.",
			    		" * 함께 하는 일을 오락시간을 갖는 것이 필요. ",
			    		" * 지나치게 편의적 노력 절약 경향이 있으므로 열성과 적극성을 키워야 한다.",
			    		" * 결정하기 전에 모든 측면을 숙고하고 고려할 시간 여유를 가질 필요가 있다.",
			    		" * 느낌이나 감정 타인에 대한 고마운 마음을 표현하기 어려워 할 때가 많다 그러므로 자신의 마음 속에 있는 느낌이나 생각 정보 계획을 개방하고 타인과 나누는 노력이 필요하다."],
	    	"person" : " 톰 크루즈, 제임스 딘, 클린트 이스트우드,전지현, 이연희, 설경구"
		  }, 
		  {
		  	"title":"ISFP",
	    	"type_img" :"./img/isfp.png",
	    	"type_title" : "예술가",
	    	"type_detail" : "말없이 다정하고 온화하며 친절하고 연기력이 뛰어나며 겸손하다.",
	    	"detail_info" : "말없이 다정하고 양털 안감을 놓은 오버코트처럼 속마음이 따뜻하고 , 친절하다 그러나 상대방을 잘 알게 될 때까지 이 따뜻함을 잘 드러내지 않는다 동정적이며 자기 능력에 대해서 모든 성격 유형 중에서 . 가장 겸손하고 적응력과 관용성이 많다. 자신의 의견이나 가치를 타인에게 강요하지 않으며 반대의견이나 충돌을 피하고 인화를 중시한다 인간과 관계되는 일을 할 때 자신과 타인의 감정에 지나치게 민감하고 결정력과 추진력이 필요할 때가 많을 것이다 일상활동에 있어서 관용적 개방적 융통성 적응력이 있다.",
	    	"character" : ["* 자신을 내세우지 않는다 자기 자랑이 없다.",
				    		"* 남을 잘 믿고 의심하지 않는다 사기 당 할 확률이 높다.",
				    		"* 누구하고나 어떤 사회에서나 맞추어 가며 살 수 있는 사람다.",
				    		"* 규칙 틀에 묶이는 것을 싫어한다.",
				    		"* 싸울 때 감정이 앞서 논리적이지 못하다.",
				    		"* 지나치게 타인을 배려한다.",
				    		"* 포용력과 이해력이 많다.",
				    		"* 즐기는 것에 대한 호기심이 많다.",
				    		"* 조직에서 시간이 오래 지나야 인정을 받는다.",
				    		"* 마음이 순하고 따뜻하며 정이 많다."],

	    	"careful" : ["* 적극적인 사고와 적극적이 행동이 필요하며 자신을 드러내는 연습이 필요.",
			    		" * 즐거움에 대한 호기심을 자제 우선순위에 맞춰 일하는 연습 필요.",
			    		" * 더 의심해 보는 습관 다른 가능성을 타진해 보는 습관을 기르고 정보를 그대로 받아들이기보다는 분석하는 방법을 육성.",
			    		" * 지나치게 신뢰하여 잘 속으며 남을 비판하지 못하는 반면 쉽게 마음을 상해서 물러나 버린다. ",
			    		" * 자기 자신의 능력을 남에게 알리고 남에게 비판적 피드백을 하는 방법을 배울 필요가 있다.",
			    		" * 보다 미래지향적 전망을 개발할 필요가 있으며 전체의 맥락을 보고자 노력함이 필요하다.",
			    		" * 주체적으로 남에게 자신감 있게 명령하는 태도를 길러야 한다."],
	    	"person" : "베토벤, 마릴린 먼로, 폴 메카트니, 오드리 햅번, 장나라, 이수근"
		  }, 
		  {
		  	"title":"INFP",
	    	"type_img" :"./img/infp.png",
	    	"type_title" : "잔다르크",
	    	"type_detail" : "정열적이고 충실하며 목가적이고 낭만적이며 내적 신념이 깊다.",
	    	"detail_info" : "이들은 논리나 단순한 흥미로움, 혹은 인생의 실용적인 부분이 아닌 그들 나름의 원리원칙에 근거하여 사고하고 행동합니다. 더욱이 성취에 따르는 보상이나 그렇지 못할 경우에 생길 수 있는 불이익 여부에 상관없이 순수한 의도로 인생의 아름다움이나 명예 그리고 도덕적 양심과 미덕을 좇으며 나름의 인생을 설계해 나갑니다. 그리고 그러한 본인들의 생각과 행동에 자부심을 느끼기도 하는데, 이는 마땅한 일입니다. 하지만 모든 사람이 그들의 생각 뒤에 숨은 동기나 의미를 정확히 파악하지는 못하는데, 이는 자칫 이들을 외톨이로 만들 수도 있습니다.",
	    	"character" : ["* 현실감각이 둔하다 가계부를 소설로 쓴다.",
				    		"* 몽상가적 기질이 많다.",
				    		"* 신념이 뚜렷하여 겉으로는 주장을 안해도 속으로는 열정이 있다.",
				    		"* 가치 있는 일에는 생명도 바친다",
				    		"* 내면의 세계를 추구하여 늘 무엇을 갈구하고 추구해 나간다.",
							"* 규칙을 몸서리치듯 싫어하며 반복되는 일상적인 생활을 싫어한다.",
							"* 맡겨진 일에 대해서는 지나치게 완벽주의 적으로 나가는 경향이 있다.",
				    		"* 싸울 때 감정이 앞서 논리적이지 못하다.",
				    		"* 지나치게 타인을 배려한다.",
				    		"* 포용력과 이해력이 많다.",
				    		"* 즐기는 것에 대한 호기심이 많다.",
				    		"* 조직에서 시간이 오래 지나야 인정을 받는다.",
				    		"* 마음이 순하고 따뜻하며 정이 많다."],

	    	"careful" : ["* 현실과 이상을 구분하는 능력이 필요.",
							"* 대인관계에서 가치관에 맞지 않는 것이라도 융통성을 보일 필요가 있다.",
							"* 꾸준함을 기르기 위해서 아주 작은 일부터 통제력을 갖는 것이 필요.",
							"* 지나치게 완벽주의로 나갈 경향이 있다.",
							"* 동시에 너무 많은 사람들을 만족시키려 드는 경향이 있고 쉽게 상처받는 경향이 있다.",
							"* 행동보다 반성에 더 많은 시간을 소모하므로 실질적으로 일하는 방법을 배울 필요가 있다.",
							"* 사실과 자신의 개인적 아이디어를 논리적으로 분석할 필요가 있다.",
							"* 행동계획을 수립하고 확고한 주장을 가지고 때로 타인의 요청을 거부할 수 있도록 노력해야 한다."],
	    	"person" : "마이클 잭슨, 윌리엄 세익스피어, 조앤 롤링, 타블로, 배두나"
		  }, 
		  {
		  	"title":"INTP",
	    	"type_img" :"./img/intp.png",
	    	"type_title" : "아이디어뱅크형",
	    	"type_detail" : "조용하고 과묵하며 논리와 분석으로 문제를 해결하기 좋아한다.",
	    	"detail_info" : "과묵하나 관심이 있는 분야에 대해서는 말을 잘하며 이해가 빠르고 높은 직관력으로 통찰하는 재능과 지적 호기심이 많다 개인적인 인간관계나 친목회 혹은 잡담 등에 별로 관심이 없으며 매우 분석적이고 논리적이며 객관적 비평을 잘 한다. 지적 호기심을 발휘할 수 있는 분야 즉 순수과학 연구 수학 엔지니 어링 분야나 추상적 개념을 다루는 경제 철학 심리학 분야의 학문을 좋아한다 지나치게 추상적이고 비현실적이며 사교성이 결여되기 쉬운경향이 있고 때로는 자신의 지적 능력을 은근히 과시하는 수가 있기때문에 거만하게 보일 수 있다.",
	    	"character" : ["* 행동하기보다 책을 통해서 배운다 책 중독",
							"* 조용하고 말이 없으나 자기의 관심 분야에서는 말을 많이 한다.",
							"* 정서표현이 별로 없어 친해지기 전에는 이해하기 어렵다.",
							"* 기분이나 감정도 생각을 통해서 한다.",
							"* 지나치게 지적이고 추상적이며 설명이 너무 이론적이다.", 
							"* 높은 직관력으로 통찰하는 재능과 지적관심이 많다",
							"* 황당무게한 공상을 잘 한다 ",
							"* 비현실적이며 비약이 심하다"],

	    	"careful" : ["* 타인의 노력을 인정하는 태도와 개인적 관점을 고려할 필요가 있다.",
							"* 팀으로 하는 일에 적극적으로 뛰어들 필요가 있다.",
							"* 구체적 현재 상황에 초점을 맞추고 현실감 있는 간단한 표현을 하는 노력이 필요하다.",
							"* 생각보다 종이에 적어보고 정리해 보는 연습이 필요.",
							"* 지나치게 추상적이므로 비현실적일 수 있고 지나치게 지적이어서 설명이 너무 이론적일 수 있다",
							"* 지나치게 비판적이고 분석적인 사고를 대인관계에 적용하는 경향으로 인간미가 없다는 평을 들을 수 있다."],
	    	"person" : "알베르트 아인슈타인, 소크라테스,이나영, 유상무, 이시영"
		  }, 
		  {
		  	"title":"ESTP",
	    	"type_img" :"./img/estp.png",
	    	"type_title" : "활동가형",
	    	"type_detail" : "현실적인 문제해결에 능하며 적응력이 강하고 관용적이다.",
	    	"detail_info" : "사실적이고 관대하며 개방적이고 사람이나 일에 대한 선입관이 별로없다 강한 현실감각으로 타협책을 모색하고 문제를 해결하는 능력이 뛰어나다 적응을 잘하고 친구를 좋아하며 긴 설명을 싫어하고 운동 음식 다양한 활동 등 주로 오관으로 보고 듣고 만질 수 있는 생활의 모든 것을 즐기는 형이다. 순발력이 뛰어나며 많은 사실들을 쉽게 기억하고 예술적인 멋과 판단 력을 지니고 있으며 연장이나 재료들을 다루는데 능숙하다 논리 분석적으로 일을 처리하고 추상적인 아이디어나 개념에 대해 별로 흥미가 없다",
	    	"character" : ["* 정보통이다 ",
	    					"* 내기를 좋아한다",
							"* 삶을 즐기며 산다 ",
							"* 사람이나 사건에 대해 선입감이 없고 개방적이다.",
							"* 스릴을 좋아한다 ",
							"* 책을 통해서 보다는 직접 경험을 선호한다.",
							"* 일을 마지막에 폭발적으로 한다",
							"* 즉흥적인 행동에 의존",
							"* 묶여 있지 않은 자유로운 상태일 때 일의 능률이 오른다 ",
							"* 흥미 위주의 욕구가 많다"],

	    	"careful" : ["* 직설적인 말보다는 배려하는 말이 필요하다.",
						"* 정신세계에 대해서 관심을 갖을 필요가 있다.",
						"* 일을 벌리기 보다는 마무리 짓는데 노력을 기울일 필요가 있다.",
						"* , 끈기와 인내 그리고 악착스러움을 더 육성할 필요가 있다.",
						"* 행동 위주로 나갈 때 남에 대해 둔감하고 무감각하게 보일 수 있으므로 타인의 감정 흐름에 민감할 필요가 있다.",
						"* , 즉흥적 행동에 지나치게 의존하며 사전계획 없이 바로 다음 문제에 뛰어드는 경향이 있다.",
						"* 물질에 집착하기 쉬우므로 물질적 즐거움 이면을 볼 수 있어야 한다.",
						"* 일을 떠벌리는 경향이 있으므로 일을 마무리 짓는데 노력할 필요가 있다."],
	    	"person" : "알베르트 아인슈타인, 소크라테스,이나영, 유상무, 이시영"
		  }, 
		 {
		  	"title":"ESFP",
	    	"type_img" :"./img/esfp.png",
	    	"type_title" : "사업가형",
	    	"type_detail" : "사교적이고 활동적이며 수용적이고 친절하며 낙천적이다.",
	    	"detail_info" : "현실적이고 실제적이며 친절하다 어떤 상황이든 잘 적응하며 수용력이 강하고 사교적이다 주위의 사람이나 일어나는 일에 대하여 관심이 많으며 사람이나 사물을 다루는 사실적인 상식이 풍부하다. 물질적 소유나 운용 등의 실생활을 즐기며 상식과 실제적 능력을 필요로 하는 분야의 일을 잘한다 의료 판매 교통 유흥업 간호직 비서직 사무직 감독직 기계를 다루는 분야를 선호한다 때로는 조금 수다스럽고 깊이가 결여되거나 마무리를 등한시하는 경향이 있으나 어떤 조직체나 공동체에서 밝고 재미있는 분위기 조성 역할을 잘한다",
	    	"character" : ["* 타인을 기쁘게 해줄 깜짝쇼를 준비하면서 즐거워한다.",
							"* 내 자신의 이야기를 상대방을 가리지 않고 아무에게나 잘 털어놓는다.",
							"* 자신에게 너그럽고 다른 대외적인 책임감이 따르는 일은 열성을 가지고 일한다.",
							"* 무계획적이고 충동적인 여행을 즐긴다. ",
							"* 발등에 불이 떨어져야 행동에 옮긴다 ",
							"* 직설적으로 말하고 흥분을 잘하며 목소리가 크다. ",
							"* 집에 있으면 무기력한 느낌이 들고 쉬는 날은 거의 외출",
							"* 청소나 빨래를 제시간에 하지 않고 몰아서 꼭 해야 할 때 한다."],

	    	"careful" : ["* 의를 끊고 맺는 것을 개발할 필요가 있다. ",
						"* 계획성 있는 일처리 방식이 필요 ",
						"* 가끔 혼자서 자기의 내면을 성찰의 시간이 필요.",
						"* 논리적이고 분석적인 기능을 육성할 필요가 있다.",
						"* 일과 레크레이션을 잘 조절하여 조화시킬 필요가 있다.",
						"* 시간관리에 노력할 필요가 있으며 일을 시작하기 전에 전체적인 계획을 세울 필요가 있다.",
						"* 주관적인 데이터를 지나치게 강조하는 경향이 있다.",
						"* 시작한 일을 끝내지 않는 경향이 있다." ],
	    	"person" : "마릴린 먼로, 빌 클린턴, 파블로 피카소, 백지영,김민희,이효리"
	  	}, 
	  	{
		  	"title":"ENFP",
	    	"type_img" :"./img/enfp.png",
	    	"type_title" : "스파크형",
	    	"type_detail" : "따뜻하고 정열적이고 활기에 넘치며 재능이 많고 상상력이 풍부하다.",
	    	"detail_info" : "온정적이고 창의적이며 항상 새로운 가능성을 찾고 시도하는 형이다. 문제 해결에 재빠르고 관심이 있는 일은 무엇이든지 수행해내는 능력과 열성이 있다 다른 사람들에게 관심을 쏟으며 사람들을 잘 다루고 뛰어난 통찰력으로 도움을 준다.반복되는 일상적인 일을 참지 못하고 열정을 갖지 못한다 또한 한가지 일을 끝내기도 전에 몇 가지 다른 일을 또 벌리는 경향을 가지고 있다.상담 교육 과학 저널리스트 광고 판매 성직 작가 등의 분야에서 뛰어난 재능을 보인다 통찰력과 창의력이 요구되지 않는 일에는 흥미를 느끼지 못하고 열정을 불러일으키지 못한다.",
	    	"character" : ["* 감정이 얼굴에 잘 들어 난다 ",
							"* 새로운 시도를 좋아한다",
							"* 계획하기보다는 그때그때 일을 처리하는 편이다. ",
							"* 새로운 사람 만나기를 좋아한다 ",
							"* 돈 개념이 희박하다 돈을 모으기 힘들 수 있다 ",
							"* 감동을 잘하고 눈물도 잘 흘린다 ",
							"* 감정의 기복이 심하다 ",
							"* 경쟁의식이 없다",
							"* 상대방의 말에 민감하나 기분이 나쁘지 않은 척 한다. ",
							"* 내면에 열정을 지녔다"],

	    	"careful" : ["* 감정의 기복을 이겨내기 위해서 꾸준한 운동이 필요.",
							"* 좋아하는 일만 하기보다 우선순위에 맞추어서 하는 것이 필요.",
							"* 상대방의 말에 대해서 객관화 작업이 필요. ",
							"* 규칙적이고 체계적일 필요가 있다.",
							"* 현실에 충실해야 한다 ",
							"* 인내심을 길러야 한다",
							"* 기존 업무를 완수하기 전에 새로운 것으로 쉽게 옮겨간다.",
							"* 관련 세부 사항을 간과한다",
							"* 지나치게 확장하고 너무 많은 일을 벌리는 경향이 있다."],
	    	"person" : "로빈 윌리암스, 산드라 블록, 빌 코스비,구혜선, 강혜정, 남상미, 하지원, 노무현"
		 }, 
		 {
		  	"title":"ENTP",
	    	"type_img" :"./img/entp.png",
	    	"type_title" : "발명가형",
	    	"type_detail" : "민첩하고 독창적이며 안목이 넓으며 다방면에 관심과 재능이 많다.",
	    	"detail_info" : "독창적이며 창의력이 풍부하고 넓은 안목을 갖고 있으며 다방면에 지능이 많다 풍부한 상상력과 새로운 일을 시도하는 솔선력이 강하며 논리적이다 새로운 문제나 복잡한 문제에 해결 능력이 뛰어나며 사람들의 동향에 대해 기민하고 박식하다 그러나 일상적이고 세부적인 일을경시하고 태만하기 쉽다.발명가 과학자 문제해결사 저널리스트 마케팅 컴퓨터 분석 등에 탁월한 능력이 있다 즉 새로운 도전이 없는 일에는 흥미가 없으나 관심을 갖고 있는 일에는 대단한 수행능력을 가지고 있다. 때로 경쟁적이며 현실보다는 이론에 더 밝은 편이다.",
	    	"character" : ["* 한번들은 얘기를 또 듣는 건 싫어한다. ",
							"* 대양 대주가 활동 무대 이건 싫어한다 ",
							"* 여자인 경우 치마를 두른 남자 같다. ",
							"* 복잡한 문제일수록 쉽게 해결한다 ",
							"* 전공이 여러 가지이다 ",
							"* 마음만 먹으면 못하는 것이 없다 ",
							"* 단어 하나로 시간도 이야기 한다 ",
							"* 굉장히 다재다능하고 능력이 있다 ",
							"* 초 중 고등학교 의 규칙생활이 힘들 수 있다. ",
							"* 일상적인 일에 쉽게 싫증을 느낀다"],

	    	"careful" : ["* 말을 할 때 저 사람이 어떻게 느낄 까 먼저 생각하는 것이 필요.",
						"* 일의 끝마무리에 대한 인내심이 필요.",
						"* 타인에 대한 칭찬 격려 인정이 필요",
						"* 다른 사람의 노력에 대해 경쟁적이 되어 쉽게 인정하지 않는다.",
						"* 새로운 아이디어와 모델에 몰입하여 현재의 중요성을 잊기 쉽다.",
						"* 자신을 과로하게 확장시킨다",
						"* 다른 사람의 노력을 인정하고 칭찬 격려 등의 표시를 할 필요가 있다",
						"* 현실적 우선순위와 일정계획을 세울 필요가 있다 왜냐하면 일상규범 표준절차를 경시하는 경향이 있다"],
	    	"person" : "토마스 에디슨, 니콜라이 테슬라,신해철, 은지원, G-드래곤"
		 }, 
		 {
		  	"title":"ESTJ",
	    	"type_img" :"./img/estj.png",
	    	"type_title" : "사업가형",
	    	"type_detail" : "구체적이고 현실적이고 사실적이며 활동을 조직화하고 주도해나가는 지도력이 있다",
	    	"detail_info" : "실질적이고 현실감각이 뛰어나며 일을 조직하고 계획하여 추진시키는 능력이 있다 기계분야나 행정 분야에 재능을 지녔으며 체계적으로 사업체나 조직체를 이끌어 나간다 타고난 지도자로써 일의 목표를 설정하고 지시하고 결정하고 이행하는 능력이 있다 속단 속결하는 경향과 지나치게 업무 위주로 사람을 대하는 경향이 있으므로 인간 중심의 가치와 타인의 감정을 충분히 고려해야 한다. 결과를 눈으로 볼 수 있는 일 즉 사업가 행정관리 생산건축 등의 분야에서 능력을 발휘할 수 있다 또 미래의 가능성보다 현재의 사실을 추구하기 때문에 현실적 실용적인 면이 강하다",
	    	"character" : ["* 감정이 잘 드러나 직설적인 언어로 표현한다. ",
							"* 솔직하고 화끈하다",
							"* 나서기를 잘한다 ",
							"* 휴일에 약속이 없으면 불안하다",
							"* 주장이 강하고 나서길 좋아한다 ",
							"* 일을 잘해 놓고도 존경받는 일이 드물 수 있다.",
							"* 논리적 분석적 객관적이며 분명한 규칙을 중요시하고 그에 따라 행동하고 일을 추진하고 완성한다.",
							"* 고집이 있지만 논리적으로 긍정하게 되면 더 이상 고집을 피우지 않는다.",
							"* 혼자서 일하기 싫어한다 ",
							"* 가만히 있으면 피곤하다"],

	    	"careful" : ["* 지나치게 일 중심적이기 때문에 가족에게 소홀 할 수 있으므로 일 보다 사람 중심적인 생활에 필요.",
						"* 급하게 결정하기 전에 여러 상황을 생각할 필요가 있다.",
						"* 타인의 정서적인 면에 관심을 가질 필요가 있다.",
						"* 타인의 관점에 주의를 돌리고 경청하는 노력을 할 필요가 있다.",
						"* 자신의 감정의 가치를 인정하고 확인할 시간 여유를 가질 필요가 있다.",
						"* 너무 성급하게 속단속결하는 경향이 있으므로 모든 측면을 배려할 필요가 있다.",
						"* 변화와 새로운 시도 추상적 이론 등을 고려하는 노력이 필요하다.",
						"* 지나치게 일 중심으로 나갈 수 있다.",
						"* 장기간 감정과 가치관이 무시되었을 때는 감정폭발이 일어날 수 있다."],
	    	"person" : "해리 트루먼, 존 록펠러, 멜 깁슨, 락밴드 오아시스의 멤버 노엘 갤러거,김태희, 윤도현"
		 },
		 {
	    	"title": "ESFJ" ,
	    	"type_img" :"./img/esfj.png",
	    	"type_title" : "친선도모형",
	    	"type_detail" : "마음이 따뜻하고 이야기하기 좋아하고 양심 바르고 인화를 잘 이룬다.",
	    	"detail_info" : "동정심이 많고 다른 사람에게 관심을 쏟고 인화를 중시한다.타고난 협력자로써 동료애가 많고 친절하며 능동적인 구성원이다. 이야기하기를 즐기며 정리정돈을 잘하고 참을성이 많으며 다른 사람을 잘 도와준다 일이나 사람들에 대한 문제에 대하여 냉철한 입장을 취하는 것을 어려워한다. 사람을 다루고 행동을 요구하는 분야 예를 들면 교직 성직 판매 특히 동정심을 필요로 하는 간호나 의료 분야에 적합하다 반대 의견에 부딪혔을 때나 자신의 요구가 거절당했을 때 마음의 상처를 받는다",
	    	"character" : ["* 신나고 재미있는 사람이다",
							"* 강의 때 고개를 제일 많이 끄덕이어 강사를 즐겁게 한다.",
							"* 준비성이 철저하며 참을성이 많고 타인을 잘 돕는다",
							"* 남에게 동조하는 경향이 뛰어나며 사람들과의 상호 활동에서 기력이 생긴다.",
							"* 타인의 인정을 받는 것에 아주 민감하다.",
							"* 보수적이며 좋은 음식을 좋아하고 봉사를 좋아하며 재물을 모으는 것을 즐긴다.",
							"* 자신이 존경하는 사람이나 물건을 이상화하는 경향이 있다.",
							"* 제품을 보고 사는 것이 아니라 의 인간적인 면에 반해서 산다"],

	    	"careful" : ["* 가족들과 독립이 필요하다",
						"* 타인의 일에 때로는 냉정하게 생각해 볼 여유가 필요하다",
						"* 잔걱정을 줄이기 위해서 걱정을 객관화 시켜 볼 필요가 있다",
						"* 타인이 진짜로 필요로 하고 원하는 것이 무엇인지를 진지하게 들을 필요가 있다.",
						"* 남을 즐겁게 하려는 욕망 때문에 자기 자신의 업무를 소홀히 다룰 수 있다."],
	    	"person" : "데니 글로버,데이비드 베컴, 노홍철,신민아"
	    }, 
	    {
	    	"title": "ENFJ" ,
	    	"type_img" :"./img/enfj.png",
	    	"type_title" : "언변 능숙형",
	    	"type_detail" : "따뜻하고 적극적이며 책임감이 강하고 사교성이 풍부하고 동정심이 많다.",
	    	"detail_info" : "민첩하고 동정심이 많고 사교적이며 인화를 중요시하고 참을성이 많다.다른 사람들의 생각이나 의견에 진지한 관심을 가지고 공동선을 위하여 다른 사람의 의견에 대체로 동의한다 현재보다는 미래의 가능성을 추구하며 편안하고 능란하게 계획을 제시하고 집단을 이끌어 가는 능력이 있다.사람을 다루는 교직 성직 심리 상담치료 예술 문학 외교 판매에 적합하다 때로 다른 사람들의 좋은 점을 지나치게 이상화하고 맹목적 충성을 보이는 경향이 있으며 다른 사람들에 대해서도 자기와 같을 것이라고 생각하는 경향이 있다.",
	    	"character" : ["* 마음이 약하고 남의 의견에 동화를 잘하는 편이다. ",
	    					"* 말로 표현을 잘하고 생각이나 마음을 잘 연다 ",
							"* . 좀 어렵게 생각되는 일도 되는 쪽으로 몰고 간다 ",
							"* 적극적이고 추진력이 강한 편이다 ",
							"* 일의 결과보다는 사람과의 인화를 더 중요시하는 편이다. ",
							"* 사람과 사람을 잘 엮는다 ",
							"* 사전 계획을 세우고 그에 따라 행하고자 한다. ",
							"* 화가 나면 겉으로 표현하지 않고 묵묵히 참아낸다 ",
							"* 타인에게 무척 사교적이지만 집에 있는 아이들에게는 안 그럴 수 있다."],

	    	"careful" : ["* 현실적인 일과 세부 사항에 대한 관심이 필요.",
						"* 인간관계를 중요하다가 큰일을 소홀히 할 수 있다.",
						"* 타인의 말에 대해서 객관적인 작업이 필요.",
						"* 인간의 제약점을 인정하고 남을 이상화하거나 맹신적 충성을 하는 경향을 조심할 필요가 있다.",
						"* 사람에 대한 관심만큼 과업의 세부사항에 대하여도 주의를 기울일 필요가 있다.",
						"* 자기비판에서 주의를 돌려 피드백에 내포되어 있는 객관적 정보에 귀를 기울일 필요가 있다.",
						"* 인간관계 사항에 끌려 과업을 소홀히 다루기 쉽다.",
						"* 비판을 개인적인 것으로 필요이상 민감하게 받아들이는 경향이 있다."],
	    	"person" : "로널드 레이건, 아브라함 링컨, 진 헤크만, 유재석, 이승기, 김미화" 
	    }, 
	    {
	    	"title": "ENTJ" ,
	    	"type_img" :"./img/entj.png",
	    	"type_title" : "지도자형",
	    	"type_detail" : "열성이 많고 솔직하고 단호하고 지도력과 통솔력이 있다.",
	    	"detail_info" : "활동적이고 솔직하며 결정력과 통솔력이 있고 장기적 계획과 거시적 안목을 선호한다 지식에 대한 욕구와 관심이 많으며 특히 지적인 자극을 주는 새로운 아이디어에 높은 관심을 가졌다 일 처리에 있어 사전준비를 철저히 하며 논리 분석적으로 계획하고 조직하여 체계적으로 추진해 나가는 형이다. 다른 사람의 의견에 귀를 기울일 필요가 있으며 자신과 타인의 감정에 충실할 필요가 있다 자신의 느낌이나 감정을 인정하고 표현함이 중요하며 성급한 판단이나 결론을 피해야 한다 그렇지 않으면 누적된 감정이 크게 폭발할 가능성도 있다.",
	    	"character" : ["* 타고난 지도자형 ",
				    		"* 조직적 체계적 계획적이다",
							"* 일은 일대로 하고 욕은 욕대로 먹을 수 있다. ",
							"* 너무 완벽을 추구하기 때문에 남이 비집고 들어갈 틈이 없다 ",
							"* 상상을 많이 한다 ",
							"* 혼자 있는 것을 싫어한다",
							"* 고집이 세고 호기심이 많다", 
							"* 동물을 별로 좋아하지 않는다", 
							"* 지적 욕구가 강하다 ",
							"* 감정표현이 솔직해서 타인이 상처를 받을 수 있다."],

	    	"careful" : ["* 속단 속결하여 배려하기보다는 강압적으로 하기 쉬우므로 직설적인 말을 삼가야 할 필요가 있다.",
							"* 타인의 말을 적극적으로 경청할 필요가 있다.",
							"* 일 중심 보다 사람중심의 생활이 필요.",
							"* 다른 사람의 감정과 일에 대한 기여를 인정할 필요성이 있으며 그들의 요구가 무엇인지 귀 기울일 필요가 있다 ",
							"* 앞으로 달려나가기 전에 실질적 개인적 상황적 상태를 검토하고 고려할 시간 여유를 가질 필요가 있다.",
							"* 자신과 타인의 감정을 인정 이해하고 표현하는 방법을 배울 필요가 있다.",
							"* 속단속결하고 참을성이 없고 강압적으로 보이기 쉬운 면을 고려해야 한다.",
							"* 자기자신의 감정을 무시하고 억압하며 타인에게 중압감을 주기 쉽다."],
	    	"person" : "빌 게이츠(혹은 INTJ), 짐 캐리, 힐러리 클린턴,강호동, 박정희, 김일성" 
	    }
	]
}	